export const vietnameseParentMap: Record<string, string> = {
  // Vowels with diacritics
  á: "a",
  à: "a",
  ả: "a",
  ã: "a",
  ạ: "a",

  ă: "a",
  ắ: "ă",
  ằ: "ă",
  ẳ: "ă",
  ẵ: "ă",
  ặ: "ă",

  â: "a",
  ấ: "â",
  ầ: "â",
  ẩ: "â",
  ẫ: "â",
  ậ: "â",

  é: "e",
  è: "e",
  ẻ: "e",
  ẽ: "e",
  ẹ: "e",

  ê: "e",
  ế: "ê",
  ề: "ê",
  ể: "ê",
  ễ: "ê",
  ệ: "ê",

  í: "i",
  ì: "i",
  ỉ: "i",
  ĩ: "i",
  ị: "i",

  ó: "o",
  ò: "o",
  ỏ: "o",
  õ: "o",
  ọ: "o",

  ô: "o",
  ố: "ô",
  ồ: "ô",
  ổ: "ô",
  ỗ: "ô",
  ộ: "ô",

  ơ: "o",
  ớ: "ơ",
  ờ: "ơ",
  ở: "ơ",
  ỡ: "ơ",
  ợ: "ơ",

  ú: "u",
  ù: "u",
  ủ: "u",
  ũ: "u",
  ụ: "u",

  ư: "u",
  ứ: "ư",
  ừ: "ư",
  ử: "ư",
  ữ: "ư",
  ự: "ư",

  ý: "y",
  ỳ: "y",
  ỷ: "y",
  ỹ: "y",
  ỵ: "y",

  // Consonants
  đ: "d",
};
